app/services/transaction_service.rb

  def process_transaction(type)
    ActiveRecord::Base.transaction do
      validate_balance!(currency_to_send)
      amount_to_receive = calculate_amount_to_receive

      transaction = user.transactions.create!(
        transaction_type: type,
        amount_usd: currency_to_send == "USD" ? amount_to_send : amount_to_receive,
        amount_btc: currency_to_send == "BTC" ? amount_to_send : amount_to_receive,
        balance_usd_at_transaction: user.balance_usd,
        balance_btc_at_transaction: user.balance_btc
      )
---
INSERT INTO "transactions" ("user_id", "transaction_type", "amount_usd", "amount_btc", "balance_usd_at_transaction", "balance_btc_at_transaction", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update_user_balance!(amount_to_receive, type)
    if type == "buy"
      user.update!(
        balance_usd: user.balance_usd - amount_to_send,
        balance_btc: user.balance_btc + amount_to_receive
      )
    else
      user.update!(
        balance_usd: user.balance_usd + amount_to_receive,
        balance_btc: user.balance_btc - amount_to_send
      )
---
UPDATE "users" SET "balance_usd" = $1, "balance_btc" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["balance_usd", "9085.000043673000002"], ["balance_btc", "0.019824612788912712717044432946998751"], ["updated_at", "2024-11-09 15:42:22.307623"], ["id", 1]]
UPDATE "users" SET "balance_usd" = $1, "balance_btc" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["balance_usd", "9808.412044773000002"], ["balance_btc", "0.010375862230014608717044432946998751"], ["updated_at", "2024-11-07 19:52:49.870088"], ["id", 1]]